/* Title for event birthday (with a name) */
"%@\\U2019s Birthday" = "Hari Lahir %@";

/* Title for event birthday (without a name) */
"Birthday" = "Hari Lahir";

"FACEBOOK_CALENDAR_NAME" = "Acara Facebook";

/* default calendar name */
"DEFAULT_CALENDAR_NAME" = "Kalendar";

/* default reminders calendar name */
"DEFAULT_TASK_CALENDAR_NAME" = "Peringatan";
// Also this one, sadly.  See 9806767 and 9696624
"Reminders" = "Peringatan";

/* Default name for an event/reminder alarm */
"DEFAULT_REMINDER_NAME" = "Peringatan";

/* Errors, returned as part of EKError object. Generally only for developers, but they might appear in UI.*/
"EVENT_NOT_MUTABLE_ERROR" = "Acara tidak dapat diubah.";

"NO_CALENDAR_ERROR" = "Tiada kalendar disetkan.";

"NO_START_DATE_ERROR" = "Tiada tarikh mula disetkan.";

"NO_END_DATE_ERROR" = "Tiada tarikh tamat disetkan.";

"DATES_INVERTED_ERROR" = "Tarikh akhir mesti selepas tarikh mula.";

"UNEXPECTED_ERROR" = "Ralat tidak dijangka telah berlaku.";

"CALENDAR_SOURCE_CANNOT_BE_MODIFIED" = "Kalendar tersebut tidak boleh dipindahkan ke akaun lain.";


"CALENDAR_READ_ONLY_ERROR" = "Kalendar untuk baca sahaja.";

"DURATION_EXCEEDS_RECURRENCE_ERROR" = "Peristiwa terlalu panjang untuk diulang sekerap ini.";

"ALARM_EXCEEDS_RECURRENCE_ERROR" = "Peristiwa berulang sebelum isyarat berlaku.";

"START_DATE_FUTURE_ERROR" = "Peristiwa terlalu jauh di masa hadapan.";

"OCCURRENCE_COLLISION_ERROR" = "Kejadian lain peristiwa ini berlaku pada tarikh ini.";

"INVITES_CANNOT_MOVE_ERROR" = "Jemputan tidak boleh dipindahkan ke kalendar lain.";

"CANNOT_GEOCODE_LOCATION_ERROR" = "Lokasi peringatan tidak dapat dikod-geo pada alamat untuk membunyikan penggera.";

/* meaningless to end users, but useful for coders. It means the event is being used with the wrong database (store). */
"WRONG_STORE_ERROR" = "Peristiwa itu tidak tergolong dalam simpanan perisitiwa tersebut.";

/* developer error */
"SPAN_ERROR" = "Julat tidak sah ditentukan.";

"CALENDAR_HAS_NO_SOURCE" = "Kalendar tidak mempunyai sumber";

"DOES_NOT_ALLOW_RECURRENCE_CHANGES" = "Medan berulang tidak boleh ditukar.";

"DOES_NOT_ALLOW_ALARM_CHANGES" = "Penggera tidak boleh diubah.";

"DOES_NOT_ALLOW_ATTENDEE_CHANGES" = "Peserta tidak boleh ditukar";

"CALENDAR_IMMUTABLE" = "Kalendar tersebut tidak boleh ditukar atau dipadam.";

"STRUCTURED_LOCATIONS_NOT_SUPPORTED" = "Lokasi dengan maklumat geo tidak disokong oleh akaun ini.";

"ACTIONS_NOT_SUPPORTED" = "Tindakan tidak disokong oleh akaun ini.";

"REMINDER_LOCATIONS_NOT_SUPPORTED" = "Lokasi untuk peringatan tidak disokong oleh akaun ini.";

"ALARM_PROXIMITY_NOT_SUPPORTED" = "Penggera berdasarkan kehampiran tidak disokong oleh akaun ini.";

"RECURRING_TASK_REQUIRES_DUE_DATE_ERROR" = "Peringatan berulang mesti mempunyai tarikh jangka.";

"SOURCE_PROHIBITS_CALENDAR_ADD_DELETE" = "Akaun tersebut tidak membenarkan kalendar untuk ditambah atau dikeluarkan.";

"CALENDAR_DOES_NOT_ALLOW_EVENTS" = "Kalendar tersebut tidak membenarkan acara ditambah.";

"CALENDAR_DOES_NOT_ALLOW_REMINDERS" = "Kalendar tersebut tidak membenarkan peringatan ditambah.";

"SOURCE_DOES_NOT_ALLOW_REMINDERS" = "Akaun tersebut tidak menyokong peringatan.";

"PRIORITY_IS_INVALID" = "Keutamaan mestilah antara 0 dan 9.";

"INVALID_ENTITY_TYPE" = "ini bukan EKEntityType yang sah.";
